
## Plan Result (user-list-search-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/65105)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.appspec


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.appspec will be created
  + resource "local_file" "appspec" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "node"
                                  + ContainerPort = 4000
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:373"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"16b0a938-0c44-4b55-b2e7-9957da10e825","JobName":"user-list-search_infrastructure_plan_prod","PRNumber":230,"Program":"tfcmt","SHA1":"e21be61963f679c2d4f4ccb65a14336a0544359d","Target":"user-list-search-cdk","Vars":{}} -->